In [8]:
！cat examples/ex2.csv

SyntaxError: invalid character in identifier (<ipython-input-8-de4d7a2cfe5e>, line 1)

In [9]:
cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
df = pd.read_csv('examples/ex1.csv')

NameError: name 'pd' is not defined

In [11]:
import pandas as pd

In [12]:
df = pd.read_csv('examples/ex1.csv')

In [13]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [17]:
names = ['a', 'b', 'c', 'd', 'message']

In [18]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [20]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [21]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
list(open('examples/ex3.csv'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [23]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [24]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [25]:
cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [26]:
cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [27]:
result = pd.read_csv('examples/ex4.csv')

In [28]:
result

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [29]:
pd.isnull(result)

                                                                     # hey!
a                                                  b        c   d     False
# just wanted to make things more difficult for... NaN      NaN NaN    True
# who reads CSV files with computers                anyway? NaN NaN    True
1                                                  2        3   4     False
5                                                  6        7   8     False
9                                                  10       11  12    False

In [30]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [31]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [33]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [34]:
pd.options.display.max_rows = 10

In [35]:
result = pd.read_csv('examples/ex6.csv')

In [36]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [37]:
result1 = pd.read_csv('examples/ex6.csv', nrows=5)

In [38]:
result1

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [39]:
re = pd.read_csv('examples/ex5.csv')

In [40]:
re

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
re. to_csv('examples/out.csv')

In [43]:
cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [44]:
import sys

In [45]:
re. to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [46]:
re. to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [47]:
re. to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [48]:
dates = pd.date_range('1/1/2000', periods=7)

In [49]:
ts = pd.Series(np.arange(7), index=dates)

NameError: name 'np' is not defined

In [50]:
import numpy as np

In [51]:
ts = pd.Series(np.arange(7), index=dates)

In [52]:
ts. to_csv('examples/tseries.csv')

In [53]:
cat examples/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [54]:
cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [55]:
import csv

In [56]:
f = open('examples/ex7.csv')

In [57]:
reader = csv.reader(f)

In [58]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [59]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [60]:
header, values = lines[0], lines[1:]

In [61]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [62]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [64]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimeter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [65]:
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [66]:
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [67]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('7', '8', '9'))

TypeError: "delimiter" must be a 1-character string

In [68]:
import json

In [69]:
result = json.loads(obj)

NameError: name 'obj' is not defined

In [70]:
obj = """
{"name":"Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet":null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}"""

In [71]:
result = json.loads(obj)

In [72]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [74]:
asjson = json.dumps(result)

In [75]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [76]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [77]:
cat examples/examples.json

cat: examples/examples.json: No such file or directory

In [78]:
data = pd.read_json('examples/example.json')

In [79]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [80]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [81]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [82]:
conda install lxml

SyntaxError: invalid syntax (<ipython-input-82-f7512ca59e33>, line 1)

In [83]:
pip install beautifulsoup4 html5lib

The following command must be run outside of the IPython shell:

    $ pip install beautifulsoup4 html5lib

The Python package manager (pip) can only be used from outside of IPython.
Please reissue the `pip` command in a separate terminal or command prompt.

See the Python documentation for more information on how to install packages:

    https://docs.python.org/3/installing/

In [84]:
conda install lxml

SyntaxError: invalid syntax (<ipython-input-84-f7512ca59e33>, line 1)

In [85]:
pip install lxml

The following command must be run outside of the IPython shell:

    $ pip install lxml

The Python package manager (pip) can only be used from outside of IPython.
Please reissue the `pip` command in a separate terminal or command prompt.

See the Python documentation for more information on how to install packages:

    https://docs.python.org/3/installing/

In [86]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [87]:
len(tables)

1

In [88]:
failures = tables[0]

In [89]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [92]:
close_timestamps = pd.to_datatime(failures['Closing Date'])

AttributeError: module 'pandas' has no attribute 'to_datatime'

In [93]:
import pandas as pd

In [94]:
close_timestamps = pd.to_datatime(failures['Closing Date'])

AttributeError: module 'pandas' has no attribute 'to_datatime'

In [95]:
frame = pd.read_csv('examples/ex1.csv')

In [96]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [97]:
frame.to_pickle('examples/frame_pickle')

In [98]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [99]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [100]:
store = pd.HDFStore('mydata.h5')

In [101]:
store['obj1'] = frame

In [102]:
store['obj1_col'] = frame['a']

In [103]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [104]:
store['obj1']

           a
0  -1.474283
1  -1.606058
2   0.802841
3  -0.881776
4  -0.756429
..       ...
95  2.068267
96  0.189162
97 -1.496734
98  0.100008
99  0.443301

[100 rows x 1 columns]

In [105]:
store.put('obj2', frame, format='table')

In [106]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.389357
11  1.913422
12  0.150991
13 -0.096565
14 -0.660507
15  0.417008

In [107]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [108]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

ValueError: The file 'mydata.h5' is already opened, but not in read-only mode (as requested).

In [109]:
xsl = pd.ExcelFile('examples/ex1.xlsx')

In [110]:
pd.read_excel(xlsx, 'Sheet1')

NameError: name 'xlsx' is not defined

In [111]:
import requests

In [112]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [113]:
resp = requests.get(url)

In [114]:
resp

In [115]:
data = resp.json()

In [116]:
data[0]['title']

'BUG: caught typeError in series.at (#25506)'

In [117]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [118]:
issues

,number,title,labels,state
0,25533,BUG: caught typeError in series.at (#25506),[],open
1,25532,DOC: fix docstring for pandas.read_parquet,[],open
2,25531,Bug groupby idxmin,[],open
3,25529,fix segfault when running with cython coverage...,[],open
4,25528,DOC: Polishing typos out of doc/source/user_gu...,[],open
...,...,...,...,...
25,25499,BUG: Overflow in IntervalIndex/IntervalArray m...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
26,25497,regression in error message for DatetimeIndex ...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
27,25495,Unexpected dtype when using .loc to set Catego...,[],open
28,25488,Fix JSON orient='table' issues with numeric co...,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
29,25484,BUG: User-facing AssertionError with add colum...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open

In [119]:
import sqlite3

In [120]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER);"""

In [121]:
con = sqlite3.connect('mydata.sqlite')

In [122]:
con.execute(query)

In [123]:
con.commit()

In [124]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [125]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [126]:
con.executemany(stmt, data)

In [127]:
cursor = con.execute('select * from test')

In [128]:
rows = cursor.fetchall()

In [129]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [130]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [131]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [132]:
import sqlalchemy as sqla

In [133]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [134]:
pd.read_sql('select * from test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []